---

C#Visual BasicVisual C++

Revit 2024 API
---
Document..::..NewGutter Method (GutterType, ReferenceArray)
Document Class See Also Send Feedback
---

Creates a gutter along a reference array.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)

# Syntax

C#
---

    public Gutter NewGutter(
    	GutterType GutterType,
    	ReferenceArray references
    )

Visual Basic
---

    Public Function NewGutter ( _
    	GutterType As GutterType, _
    	references As ReferenceArray _
    ) As Gutter

Visual C++
---

    public:
    Gutter^ NewGutter(
    	GutterType^ GutterType,
    	ReferenceArray^ references
    )

#### Parameters

GutterType
    Type: Autodesk.Revit.DB.Architecture..::..GutterType The type of the gutter to create

references
    Type: Autodesk.Revit.DB..::..ReferenceArray An array of planar lines and arcs that represents the place where you want to place the gutter.

#### Return Value

If successful a new gutter object within the project, otherwise nullNothingnullptra null reference (Nothing in Visual Basic).

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown if the gutter type does not exist in the given document. |

# See Also

Document Class

NewGutter Overload

Autodesk.Revit.Creation Namespace